Repository: talowa-org/talowa4
Catalog: lib/l10n/app_*.arb
Languages: te, ur

# appName
source: TALOWA
te: తలావా
ur: تلاوا

source: Welcome Back!
te: తిరిగి స్వాగతం!
ur: واپس آئیں!

source: Sign in to your account
te: మీ ఖాతాలోకి సైన్ ఇన్ చేయండి
ur: اپنے اکاؤنٹ میں سائن ان کریں

source: Mobile Number
te: మొబైల్ నంబర్
ur: موبائل نمبر

# sixDigitPin
source: 6-Digit PIN
te: 6-అంకెల పిన్
ur: 6 ہندسوں کا پن

source: Sign In
te: సైన్ ఇన్
ur: سائن ان

source: Register
te: నమోదు
ur: رجسٹر

# dontHaveAccount
source: Don't have an account?
te: ఖాతా లేదా?
ur: اکاؤنٹ نہیں ہے؟

source: Login successful!
te: లాగిన్ విజయవంతం!
ur: لاگ ان کامیاب!

# loginFailed
source: Login failed. Please try again.
te: లాగిన్ విఫలమైంది. దయచేసి మళ్లీ ప్రయత్నించండి.
ur: لاگ ان ناکام۔ براہ کرم دوبارہ کوشش کریں۔

# invalidCredentials
source: The supplied auth credential is incorrect, malformed or has expired.
te: అందించిన ప్రమాణీకరణ వివరాలు తప్పు, దెబ్బతిన్నవి లేదా గడువు ముగిసినవి.
ur: فراہم کردہ تصدیقی معلومات غلط، خراب یا ختم ہو گئی ہیں۔

source: Home
te: హోమ్
ur: ہوم

source: Feed
te: ఫీడ్
ur: فیڈ

source: Messages
te: సందేశాలు
ur: پیغامات

source: Network
te: నెట్‌వర్క్
ur: نیٹ ورک

source: More
te: మరిన్ని
ur: مزید

# goodMorning
source: Good morning! How is your day?
te: శుభోదయం! మీ రోజు ఎలా ఉంది?
ur: صبح بخیر! آپ کا دن کیسا ہے؟

# goodAfternoon
source: Good afternoon! Hope you're having a great day.
te: శుభ మధ్యాహ్నం! మీ రోజు బాగా గడుస్తుందని ఆశిస్తున్నాను.
ur: دوپہر بخیر! امید ہے آپ کا دن اچھا گزر رہا ہے۔

# goodEvening
source: Good evening! How was your day?
te: శుభ సాయంత్రం! మీ రోజు ఎలా గడిచింది?
ur: شام بخیر! آپ کا دن کیسا گزرا؟

source: Welcome to TALOWA
te: తలావాకు స్వాగతం
ur: تلاوا میں خوش آمدید

source: Member
te: సభ్యుడు
ur: رکن

source: Ask anything...
te: ఏదైనా అడగండి...
ur: کچھ بھی پوچھیں...

source: Land Issues
te: భూమి సమస్యలు
ur: زمین کے مسائل

source: My Network
te: నా నెట్‌వర్క్
ur: میرا نیٹ ورک

source: Legal Help
te: న్యాయ సహాయం
ur: قانونی مدد

source: Support
te: మద్దతు
ur: سپورٹ

source: Today's Inspiration Message
te: నేటి ప్రేరణా సందేశం
ur: آج کا حوصلہ افزا پیغام

# unitedWeStandProtectOurLand
source: United we stand, let's protect our land together.
te: కలిసి మన భూమిని కాపాడుకుంటాం.
ur: متحد ہو کر ہم اپنی زمین کی حفاظت کریں گے۔

source: Debug Tools
te: డీబగ్ టూల్స్
ur: ڈیبگ ٹولز

source: Create Test User
te: టెస్ట్ యూజర్ సృష్టించండి
ur: ٹیسٹ یوزر بنائیں

source: Check User
te: యూజర్ తనిఖీ చేయండి
ur: یوزر چیک کریں

source: Test Firebase
te: ఫైర్‌బేస్ టెస్ట్
ur: فائر بیس ٹیسٹ

source: Fill Test Data
te: టెస్ట్ డేటా నింపండి
ur: ٹیسٹ ڈیٹا بھریں

source: Main Services
te: ప్రధాన సేవలు
ur: اہم خدمات

source: My Land
te: నా భూమి
ur: میری زمین

source: View land details
te: భూమి వివరాలు చూడండి
ur: زمین کی تفصیلات دیکھیں

source: Payments
te: చెల్లింపులు
ur: ادائیگیاں

source: View transactions
te: లావాదేవీలు చూడండి
ur: لین دین دیکھیں

source: Community
te: సమాజం
ur: کمیونٹی

source: Connect with people
te: వ్యక్తులతో కనెక్ట్ అవ్వండి
ur: لوگوں سے جڑیں

source: Profile
te: ప్రొఫైల్
ur: پروفائل

source: Account management
te: ఖాతా నిర్వహణ
ur: اکاؤنٹ کا انتظام

source: My Referrals
te: నా రెఫరల్స్
ur: میرے ریفرلز

source: Team Size
te: టీమ్ సైజ్
ur: ٹیم کا سائز

source: Land Status
te: భూమి స్థితి
ur: زمین کی حالت

source: Active
te: చురుకుగా
ur: فعال

source: Emergency Services
te: అత్యవసర సేవలు
ur: ہنگامی خدمات

source: Report Land Grabbing
te: భూమి ఆక్రమణను నివేదించండి
ur: زمین پر قبضے کی اطلاع دیں

source: Language Settings
te: భాషా సెట్టింగ్‌లు
ur: زبان کی ترتیبات

# selectPreferredLanguage
source: Select your preferred language:
te: మీ ఇష్టపడే భాషను ఎంచుకోండి:
ur: اپنی پسندیدہ زبان منتخب کریں:

source: Apply Changes
te: మార్పులను వర్తింపజేయండి
ur: تبدیلیاں لاگو کریں

source: Language Preview
te: భాషా ప్రివ్యూ
ur: زبان کا پیش نظارہ

# welcomeToTalowaPreview
source: Welcome to TALOWA! Your land rights are protected.
te: తలావాకు స్వాగతం! మీ భూమి హక్కులు రక్షించబడ్డాయి.
ur: تلاوا میں خوش آمدید! آپ کے زمینی حقوق محفوظ ہیں۔

# languageChangedTo
source: Language changed to {language}
te: భాష {language}కి మార్చబడింది
ur: زبان {language} میں تبدیل کر دی گئی

# failedToChangeLanguage
source: Failed to change language: {error}
te: భాష మార్చడంలో విఫలమైంది: {error}
ur: زبان تبدیل کرنے میں ناکامی: {error}

# hardWorkWillPayOff
source: Your hard work will pay off. Together we stand strong!
te: మీ కష్టం ఫలిస్తుంది. జై కిసాన్!
ur: آپ کی محنت رنگ لائے گی۔ جے کسان!

# togetherWeProtectLand
source: Together we will protect our land.
te: కలిసి మన భూమిని కాపాడుకుంటాం.
ur: مل کر ہم اپنی زمین کی حفاظت کریں گے۔

# yourRightYourLand
source: Your right, your land, your dignity.
te: మీ హక్కు, మీ భూమి, మీ గౌరవం.
ur: آپ کا حق، آپ کی زمین، آپ کی عزت۔

# rameshwarVictory
source: Rameshwar's Victory
te: రామేశ్వర్ విజయం
ur: رامیشور کی فتح

# rameshwarVictoryStory
source: After 15 years, Telangana's Rameshwar finally got his land title.
te: 15 సంవత్సరాల తర్వాత, తెలంగాణకు చెందిన రామేశ్వర్ తన భూమి పట్టా పొందాడు.
ur: 15 سال بعد، تلنگانہ کے رامیشور کو اپنی زمین کا پٹہ مل گیا۔

# sunitaLandRights
source: Sunita's Land Rights
te: సునీత భూమి హక్కులు
ur: سنیتا کے زمینی حقوق

# sunitaLandRightsStory
source: Sunita from Karnataka successfully defended her 3-acre farm from illegal occupation.
te: కర్ణాటకకు చెందిన సునీత తన 3 ఎకరాల పొలాన్ని అక్రమ ఆక్రమణ నుండి రక్షించుకుంది.
ur: کرناٹک کی سنیتا نے اپنے 3 ایکڑ کھیت کو غیر قانونی قبضے سے بچایا۔

# sambuddhaVictory
source: Sambuddha's Victory
te: సముద్ర విజయం
ur: سمبدھ کی فتح

# telanganaSambuddhaLandVictoryStory
source: After 15 years, Telangana's Sambuddha finally got his land back.
te: 15 సంవత్సరాల తర్వాత, తెలంగాణకు చెందిన సముద్రకు చివరకు తన భూమి తిరిగి లభించింది.
ur: 15 سال بعد، تلنگانہ کے سمبدھ کو آخر کار اپنی زمین واپس مل گئی۔

source: Full Name
te: పూర్తి పేరు
ur: پورا نام

# village
source: Village/City
te: గ్రామం/నగరం
ur: گاؤں/شہر

# mandal
source: Mandal/Tehsil
te: మండలం
ur: منڈل/تحصیل

source: District
te: జిల్లా
ur: ضلع

source: State
te: రాష్ట్రం
ur: ریاست

# referralCode
source: Referral Code (Optional)
te: రెఫరల్ కోడ్ (ఐచ్ఛికం)
ur: ریفرل کوڈ (اختیاری)

source: Complete Registration
te: నమోదు పూర్తి చేయండి
ur: رجسٹریشن مکمل کریں

source: Registration successful!
te: నమోదు విజయవంతం!
ur: رجسٹریشن کامیاب!

# registrationFailed
source: Registration failed. Please try again.
te: నమోదు విఫలమైంది. దయచేసి మళ్లీ ప్రయత్నించండి.
ur: رجسٹریشن ناکام۔ براہ کرم دوبارہ کوشش کریں۔

source: Phone number already registered
te: ఫోన్ నంబర్ ఇప్పటికే నమోదు చేయబడింది
ur: فون نمبر پہلے سے رجسٹرڈ ہے

# invalidPhoneNumber
source: Invalid phone number format
te: చెల్లని ఫోన్ నంబర్ ఫార్మాట్
ur: غلط فون نمبر فارمیٹ

# pinTooShort
source: PIN must be at least 6 digits
te: పిన్ కనీసం 6 అంకెలు ఉండాలి
ur: پن کم از کم 6 ہندسوں کا ہونا چاہیے

# fieldRequired
source: This field is required
te: ఈ ఫీల్డ్ అవసరం
ur: یہ فیلڈ ضروری ہے

# networkError
source: Network error. Please check your connection.
te: నెట్‌వర్క్ లోపం. దయచేసి మీ కనెక్షన్‌ను తనిఖీ చేయండి.
ur: نیٹ ورک کی خرابی۔ براہ کرم اپنا کنکشن چیک کریں۔

# somethingWentWrong
source: Something went wrong. Please try again.
te: ఏదో తప్పు జరిగింది. దయచేసి మళ్లీ ప్రయత్నించండి.
ur: کچھ غلط ہوا۔ براہ کرم دوبارہ کوشش کریں۔

source: Loading...
te: లోడ్ అవుతోంది...
ur: لوڈ ہو رہا ہے...

source: Retry
te: మళ్లీ ప్రయత్నించండి
ur: دوبارہ کوشش کریں

source: Cancel
te: రద్దు చేయండి
ur: منسوخ کریں

source: Save
te: సేవ్ చేయండి
ur: محفوظ کریں

source: Edit
te: సవరించండి
ur: ترمیم کریں

source: Delete
te: తొలగించండి
ur: حذف کریں

source: Confirm
te: నిర్ధారించండి
ur: تصدیق کریں

source: Yes
te: అవును
ur: ہاں

source: No
te: లేదు
ur: نہیں

source: OK
te: సరే
ur: ٹھیک ہے

source: Close
te: మూసివేయండి
ur: بند کریں

source: Search
te: వెతకండి
ur: تلاش کریں

source: No results found
te: ఫలితాలు కనుగొనబడలేదు
ur: کوئی نتیجہ نہیں ملا

source: Pull to refresh
te: రిఫ్రెష్ చేయడానికి లాగండి
ur: ریفریش کرنے کے لیے کھینچیں

source: Refreshing...
te: రిఫ్రెష్ అవుతోంది...
ur: ریفریش ہو رہا ہے...

source: Offline
te: ఆఫ్‌లైన్
ur: آف لائن

source: Online
te: ఆన్‌లైన్
ur: آن لائن

source: Settings
te: సెట్టింగ్‌లు
ur: ترتیبات

source: Notifications
te: నోటిఫికేషన్‌లు
ur: اطلاعات

source: Privacy
te: గోప్యత
ur: رازداری

source: Security
te: భద్రత
ur: سیکیورٹی

source: About
te: గురించి
ur: کے بارے میں

source: Help
te: సహాయం
ur: مدد

source: Contact Support
te: మద్దతును సంప్రదించండి
ur: سپورٹ سے رابطہ کریں

source: Logout
te: లాగ్అవుట్
ur: لاگ آؤٹ

# logoutConfirmation
source: Are you sure you want to logout?
te: మీరు నిజంగా లాగ్అవుట్ చేయాలనుకుంటున్నారా?
ur: کیا آپ واقعی لاگ آؤٹ کرنا چاہتے ہیں؟

source: Version
te: వెర్షన్
ur: ورژن

# buildNumber
source: Build
te: బిల్డ్
ur: بلڈ

source: Terms of Service
te: సేవా నిబంధనలు
ur: خدمات کی شرائط

source: Privacy Policy
te: గోప్యతా విధానం
ur: رازداری کی پالیسی

source: Share App
te: యాప్ షేర్ చేయండి
ur: ایپ شیئر کریں

source: Rate App
te: యాప్‌ను రేట్ చేయండి
ur: ایپ کو ریٹ کریں

source: Send Feedback
te: ఫీడ్‌బ్యాక్ పంపండి
ur: فیڈبیک بھیجیں

source: Report Bug
te: బగ్ రిపోర్ట్ చేయండి
ur: بگ رپورٹ کریں

source: Check for Updates
te: అప్‌డేట్‌ల కోసం తనిఖీ చేయండి
ur: اپڈیٹس کے لیے چیک کریں

# appUpToDate
source: App is up to date
te: యాప్ అప్ టు డేట్‌లో ఉంది
ur: ایپ اپ ٹو ڈیٹ ہے

source: Update available
te: అప్‌డేట్ అందుబాటులో ఉంది
ur: اپڈیٹ دستیاب ہے

source: Update Now
te: ఇప్పుడే అప్‌డేట్ చేయండి
ur: ابھی اپڈیٹ کریں

source: Update Later
te: తర్వాత అప్‌డేట్ చేయండి
ur: بعد میں اپڈیٹ کریں
